## ----setup, include=FALSE-----------------------------------------------------
knitr::opts_chunk$set(echo = TRUE)
library(SA24204149)

## -----------------------------------------------------------------------------
#####################################################
### Function factor to estimate number of factors ###
#####################################################
#研究课题与因子模型有关，其中估计因子之前需要估计因子的个数，利用这个函数可以解决这个问题
#通过计算样本协方差矩阵X^T*X的特征值，利用样本协方差矩阵的最大特征特征值聚在单点周围这个事实，并设置了最大因子个数rmax，来估计模型因子的个数
set.seed(2)

#定义矩阵维度
n=200#数据点个数
p=1000#维度
k = 3 #因子个数

#生成因子模型数据矩阵
B = matrix(rnorm(p*k, 0,1), p,k)
F = matrix(rnorm(n*k, 0,1), n,k)
U = matrix(rnorm(p*n, 0,2), p,n)
X = B%*%t(F)+U
X= t(X)#X为n*p维矩阵

rmax<-10#最大因子个数设置为10

factor_number<-factor(X,rmax)
factor_number
##通过factor函数计算出来因子个数为3，与因子个数假定相同，说明函数效果还行

## -----------------------------------------------------------------------------
#######################################################
###     Function for calculating loss funtion       ###
#######################################################
##这个函数定义了一个加权平方误差损失函数，其中权重由一个指数衰减函数决定。
# 
# lossfunction:
# loss = sum(weight * error^2)
# 其中:
# weight = exp(-alpha * |error|)
# error = ytrue[i] - ypred[i]
#
# 创建真实值向量和预测值向量
y_true <- c(1, 2, 3, 4, 5)
y_pred <- c(1.2, 2.3, 3.4, 4.5, 5.6)

# 设置权重参数alpha
alpha <- 0.5

# 计算损失值
loss <- LossFunction(y_true, y_pred, alpha)

# 输出损失值
print(loss)


